Revit 2024 API
SpecTypeId.PipeDimension Property
 Pipe Dimension, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipeDimension { get; }
Visual Basic
Public Shared ReadOnly Property PipeDimension As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipeDimension {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace